# AllCurveLoops Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Path3d..::..AllCurveLoops Property
Path3d Class See Also
---
Get all the Curve Loops of Path3d.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveArrArray AllCurveLoops { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AllCurveLoops As CurveArrArray
	Get
```

Visual C++
---
```text
public:
property CurveArrArray^ AllCurveLoops {
	CurveArrArray^ get ();
}
```

# Remarks
Returns all the Curve Loops of Path3d.
# See Also
Path3d Class
Autodesk.Revit.DB Namespace